<a href="#"><img  height="50" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/header.svg" /></a> 



<div align="right">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" /></a>&nbsp;1&nbsp;Medium</div><br>

<table>

<thead>

<tr>

<th align="left" scope="col">Risk ID</th>

<th align="left" scope="col">Severity</th>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">Folder/s</th>

<th align="left" scope="col">Summary</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

<td>O09-I-SG</td>

<td align="center"><a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" /></a></td>

<td align="center"><sub><a href="#"><img  width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/aws.svg" /></a></sub></td>

<td>Scenario 10</td>

<td>SMTP can exit your network to more than 256 Public IPs</td>

</tr>
                 
</tbody>
</table>

**Detailed Risks Report**
---
<details>
<summary><sub><sub><sub><a href="#"><img  height="20" width="20" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/warning.svg" /></a></sub></sub></sub>&nbsp;&nbsp;<h3><b>Scenario 10</b></h3><div  align="right">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" /></a>&nbsp;1&nbsp;Medium</div></summary>
<details>

<summary><a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" /></a>  O09-I-SG</summary> 

### **Title:**
SMTP can exit your network to more than 256 Public IPs

### **Description:**
Allowing outbound SMTP access on TCP port 25/465/587 from many internal machines is risky.  Outbound SMTP (E-mail) should only originate from your public mail servers.  E-mail is a vector for many viruses and worms.  Computers that can send E-mail directly (not through your organization's designated mail servers) can bypass your network's E-mail filters, and spread viruses and worms to other networks.  Therefore, outbound SMTP access should be limited to your properly hardened public mail servers. 

### **Recommendation:**
Restrict the rules to refer to only the destination IPs you really use, and limit the number of public IP addresses that can be reached on this port. 

### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

  <td>AWS</td>

  <td>25</td>

  <td>25</td>

  <td>tcp</td>

  <td>7.7.0.0/16</td>

  </tr>
                
</tbody>
</table>

</details>



<details>
<summary>Terraform Log</summary>
<br>Output

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.Scenario10 will be created
  + resource "aws_security_group" "Scenario10" {
      + arn                    = (known after apply)
      + description            = "egress"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "7.7.0.0/16",
                ]
              + description      = ""
              + from_port        = 25
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 25
            },
          + {
              + cidr_blocks      = [
                  + "7.7.0.0/16",
                ]
              + description      = ""
              + from_port        = 25
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = false
              + to_port          = 25
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "Scenario10"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "SG with Single port(UDP and TCP) and all IP."
        }
      + tags_all               = {
          + "Name" = "SG with Single port(UDP and TCP) and all IP."
        }
      + vpc_id                 = "vpc-481b202f"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/DevSecpsRepoForAutomation/DevSecpsRepoForAutomation_ALGOSEC_CODE_ANALYSIS/Scenario 10\tmp\Scenario 10.out

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/DevSecpsRepoForAutomation/DevSecpsRepoForAutomation_ALGOSEC_CODE_ANALYSIS/Scenario 10\\tmp\\Scenario 10.out"


```
<br>

</details> <!-- End Format Logs -->

</details>

---


<br>
Pusher: @similAlgo<br>
Action: pull_request<br>
Workflow: Test Repo CI/CD